mbraudio/ampx_nrf52/main.c
    //err_code = pm_register(pm_evt_handler);
    //APP_ERROR_CHECK(err_code);
}
*/

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for UART processing.*/
static void process_uart(void)
{
    if (!uartWorker.enabled)
    {
        return;
    }

    if (uartWorker.ble_buffer_available)
    {
        if (app_uart_get(&uartWorker.byte) == NRF_SUCCESS)
        {
            ampx_led_rx_on();

            uartWorker.buffer[uartWorker.byte_index] = uartWorker.byte;
            uartWorker.byte_index++;
            
            if (uartWorker.byte == 0)
            {
#ifdef PRINT_STM_NRF_COMM
                NRF_LOG_INFO("STM -> BLE");
                NRF_LOG_HEXDUMP_INFO(uartWorker.buffer, uartWorker.byte_index);
#endif
                uartWorker.ble_buffer_available = ble_rws_try_to_send(&m_rws, uartWorker.buffer, &uartWorker.byte_index, m_conn_handle);
                if (uartWorker.ble_buffer_available)
                { 
                    uartWorker.byte_index = 0;
                }
            }
        }
    }

    if (uartWorker.tx_complete)
    {
#ifdef PRINT_STM_NRF_COMM
        NRF_LOG_INFO("STM -> BLE. (2)");
        NRF_LOG_HEXDUMP_INFO(uartWorker.buffer, uartWorker.byte_index);
#endif
        uartWorker.tx_complete = 0;
        uartWorker.ble_buffer_available = ble_rws_try_to_send(&m_rws, uartWorker.buffer, &uartWorker.byte_index, m_conn_handle);
        if (uartWorker.ble_buffer_available)
        {
            uartWorker.byte_index = 0;
        }
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    nrf_timers_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    uart_init();
    ampx_init();

    // Start execution.
    NRF_LOG_INFO("AmpX started.");

    advertising_start();

    // Enter main loop.
    while (1)
    {
        //idle_state_handle();
        process_uart();
    }
}


/**
 * @}
 */
